Tekla Open API Reference for Tekla Structures 2025
HatchAttributes.TrueBackgroundColor Property
 The true color (rgb enabled) of the hatch background.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TeklaDrawingColor TrueBackgroundColor { get; set; }
Public Property TrueBackgroundColor As TeklaDrawingColor
	Get
	Set
Property Value
Type: TeklaDrawingColor
Exceptions
Exception | Condition
ArgumentOutOfRangeException | The get method will throw if the inputColor is not supported (0-7, 120 for example). You should use this function in a try-catch statement, since non-supported colors are used in TeklaStructures, especially in older models. Define your own catch logic (default color, error message, etc) based on your use case.
See Also
Reference
HatchAttributes Class
Tekla.Structures.Drawing Namespace